###############################################################
#  Generated by:      Cadence Innovus 20.14-s095_1
#  OS:                Linux x86_64(Host ID vlsi-5.iiitk.ac.in)
#  Generated on:      Wed Mar 25 17:57:15 2026
#  Design:            bfv_top
#  Command:           routeDesign -globalDetail
###############################################################
current_design bfv_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_clock_transition  -rise -min 0.2 [get_clocks {clk}]
set_clock_transition  -rise -max 0.2 [get_clocks {clk}]
set_clock_transition  -fall -min 0.2 [get_clocks {clk}]
set_clock_transition  -fall -max 0.2 [get_clocks {clk}]
set_input_transition 0.5  [get_ports {clk}]
set_input_transition 0.5  [get_ports {rst_n}]
set_input_transition 0.5  [get_ports {start}]
set_input_transition 0.5  [get_ports {sk[13]}]
set_input_transition 0.5  [get_ports {sk[12]}]
set_input_transition 0.5  [get_ports {sk[11]}]
set_input_transition 0.5  [get_ports {sk[10]}]
set_input_transition 0.5  [get_ports {sk[9]}]
set_input_transition 0.5  [get_ports {sk[8]}]
set_input_transition 0.5  [get_ports {sk[7]}]
set_input_transition 0.5  [get_ports {sk[6]}]
set_input_transition 0.5  [get_ports {sk[5]}]
set_input_transition 0.5  [get_ports {sk[4]}]
set_input_transition 0.5  [get_ports {sk[3]}]
set_input_transition 0.5  [get_ports {sk[2]}]
set_input_transition 0.5  [get_ports {sk[1]}]
set_input_transition 0.5  [get_ports {sk[0]}]
set_input_transition 0.5  [get_ports {a_key[13]}]
set_input_transition 0.5  [get_ports {a_key[12]}]
set_input_transition 0.5  [get_ports {a_key[11]}]
set_input_transition 0.5  [get_ports {a_key[10]}]
set_input_transition 0.5  [get_ports {a_key[9]}]
set_input_transition 0.5  [get_ports {a_key[8]}]
set_input_transition 0.5  [get_ports {a_key[7]}]
set_input_transition 0.5  [get_ports {a_key[6]}]
set_input_transition 0.5  [get_ports {a_key[5]}]
set_input_transition 0.5  [get_ports {a_key[4]}]
set_input_transition 0.5  [get_ports {a_key[3]}]
set_input_transition 0.5  [get_ports {a_key[2]}]
set_input_transition 0.5  [get_ports {a_key[1]}]
set_input_transition 0.5  [get_ports {a_key[0]}]
set_input_transition 0.5  [get_ports {e_key[13]}]
set_input_transition 0.5  [get_ports {e_key[12]}]
set_input_transition 0.5  [get_ports {e_key[11]}]
set_input_transition 0.5  [get_ports {e_key[10]}]
set_input_transition 0.5  [get_ports {e_key[9]}]
set_input_transition 0.5  [get_ports {e_key[8]}]
set_input_transition 0.5  [get_ports {e_key[7]}]
set_input_transition 0.5  [get_ports {e_key[6]}]
set_input_transition 0.5  [get_ports {e_key[5]}]
set_input_transition 0.5  [get_ports {e_key[4]}]
set_input_transition 0.5  [get_ports {e_key[3]}]
set_input_transition 0.5  [get_ports {e_key[2]}]
set_input_transition 0.5  [get_ports {e_key[1]}]
set_input_transition 0.5  [get_ports {e_key[0]}]
set_load -pin_load -max  2  [get_ports {done}]
set_load -pin_load -min  2  [get_ports {done}]
set_load -pin_load -max  2  [get_ports {state_out[3]}]
set_load -pin_load -min  2  [get_ports {state_out[3]}]
set_load -pin_load -max  2  [get_ports {state_out[2]}]
set_load -pin_load -min  2  [get_ports {state_out[2]}]
set_load -pin_load -max  2  [get_ports {state_out[1]}]
set_load -pin_load -min  2  [get_ports {state_out[1]}]
set_load -pin_load -max  2  [get_ports {state_out[0]}]
set_load -pin_load -min  2  [get_ports {state_out[0]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[13]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[13]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[12]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[12]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[11]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[11]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[10]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[10]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[9]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[9]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[8]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[8]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[7]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[7]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[6]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[6]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[5]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[5]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[4]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[4]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[3]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[3]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[2]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[2]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[1]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[1]}]
set_load -pin_load -max  2  [get_ports {dbg_pk1[0]}]
set_load -pin_load -min  2  [get_ports {dbg_pk1[0]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[13]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[13]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[12]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[12]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[11]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[11]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[10]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[10]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[9]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[9]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[8]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[8]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[7]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[7]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[6]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[6]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[5]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[5]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[4]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[4]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[3]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[3]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[2]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[2]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[1]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[1]}]
set_load -pin_load -max  2  [get_ports {dbg_pk2[0]}]
set_load -pin_load -min  2  [get_ports {dbg_pk2[0]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[11]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[11]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[10]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[10]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[9]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[9]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[8]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[8]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[7]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[7]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[6]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[6]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[5]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[5]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[4]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[4]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[3]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[3]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[2]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[2]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[1]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[1]}]
set_load -pin_load -max  2  [get_ports {dbg_pix_cnt[0]}]
set_load -pin_load -min  2  [get_ports {dbg_pix_cnt[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[12]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[12]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[12]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[12]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[7]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[7]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[7]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[7]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[2]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[2]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[11]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[11]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[7]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[7]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[3]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[3]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[3]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[3]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[13]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[13]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[13]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[13]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[8]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[8]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[8]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[8]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[3]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[3]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[12]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[12]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[8]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[8]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[4]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[4]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[4]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[4]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {start}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {start}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[9]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[9]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[9]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[9]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[4]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[4]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[0]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[0]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[0]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[0]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[13]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[13]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[10]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[10]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[10]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[10]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[9]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[9]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[5]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[5]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[5]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[5]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[0]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[0]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[5]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[5]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[1]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[1]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[1]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[1]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[11]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[11]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[11]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[11]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[6]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[6]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[6]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[6]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[1]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[1]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[10]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[10]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {e_key[6]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {e_key[6]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {sk[2]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {sk[2]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {a_key[2]}]
set_input_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {a_key[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[7]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {state_out[0]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {state_out[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[10]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[10]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[5]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[5]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[3]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[1]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[11]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[11]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[1]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[8]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[8]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {state_out[1]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {state_out[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[11]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[11]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[6]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[6]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[4]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[2]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[12]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[12]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[2]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[9]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[9]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {done}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {done}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {state_out[2]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {state_out[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[12]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[12]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[0]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[7]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[10]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[10]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[7]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[5]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[3]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[13]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[13]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[3]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {state_out[3]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {state_out[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[13]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[13]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[1]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[11]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[11]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[8]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[8]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[8]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[8]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[6]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[4]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[4]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[2]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pix_cnt[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[9]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[9]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[10]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[10]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[9]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[9]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk2[0]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk2[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {dbg_pk1[0]}]
set_output_delay -add_delay 0.5 -max -clock [get_clocks {clk}] [get_ports {dbg_pk1[0]}]
set_clock_uncertainty 0.1 -hold [get_clocks {clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {clk}]
